app/controllers/documents_controller.rb

  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("created_at", "docUrl", "name", "txtUrl", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 12 Jan 2014 01:09:57 UTC +00:00], ["docUrl", "that"], ["name", "this"], ["txtUrl", "that"], ["updated_at", Sun, 12 Jan 2014 01:09:57 UTC +00:00]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]