app/controllers/homes_controller.rb

  def index
    @homes = Home.all
---
SELECT "homes".* FROM "homes"

  def update
    respond_to do |format|
      if @home.update(home_params)
---
UPDATE "homes" SET "content" = ?, "updated_at" = ? WHERE "homes"."id" = 1  [["content", "<p>Here's some content in a 'p' tag </p>"], ["updated_at", Sat, 11 Jan 2014 22:05:17 UTC +00:00]]

    def set_home
      @home = Home.find(params[:id])
---
SELECT "homes".* FROM "homes" WHERE "homes"."id" = ? LIMIT 1  [["id", 1]]