app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT "news".* FROM "news"

  def create
    @news = News.new(news_params)

    respond_to do |format|
      if @news.save
---
INSERT INTO "news" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Here's the content!"], ["created_at", Sat, 11 Jan 2014 23:03:48 UTC +00:00], ["title", "Here's a title!"], ["updated_at", Sat, 11 Jan 2014 23:03:48 UTC +00:00]]

    def set_news
      @news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]