app/controllers/outreaches_controller.rb

  def index
    @outreaches = Outreach.all
---
SELECT "outreaches".* FROM "outreaches"

  def create
    @outreach = Outreach.new(outreach_params)

    respond_to do |format|
      if @outreach.save
---
INSERT INTO "outreaches" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "<p>This works. Hopefully</p>\r\n"], ["created_at", Sun, 12 Jan 2014 01:46:32 UTC +00:00], ["title", "there we go"], ["updated_at", Sun, 12 Jan 2014 01:46:32 UTC +00:00]]

    def set_outreach
      @outreach = Outreach.find(params[:id])
---
SELECT "outreaches".* FROM "outreaches" WHERE "outreaches"."id" = ? LIMIT 1  [["id", "1"]]