app/controllers/projects_controller.rb

INSERT INTO "projects" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", ";oisadhfuahfahdf"], ["created_at", Sat, 11 Jan 2014 23:06:39 UTC +00:00], ["name", "Project 1"], ["updated_at", Sat, 11 Jan 2014 23:06:39 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save